Revit 2027 API
BuiltInFailures.DesignOptionFailures.CannotPutELZInOption Property
 Area Based Loads must be in the Main Model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotPutELZInOption { get; }
Public Shared ReadOnly Property CannotPutELZInOption As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotPutELZInOption {
	FailureDefinitionId^ get ();
}
static member CannotPutELZInOption : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace